from django import forms


class G1racesForm(forms.Form):

    #レース年度のセレクトフォームを作成
    year_name = [
        ('2019', '2019年'),
        ('2018', '2018年'),
        ('2017', '2017年'),
        ('2016', '2016年'),
        ('2015', '2015年'),
        ('2014', '2014年'),
        ('2013', '2013年'),
        ('2012', '2012年'),
        ('2011', '2011年'),
        ('2010', '2010年')
    ]
    year = forms.ChoiceField(label='年 度', choices=year_name)

    #レース名のセレクトフォームを作成
    g1name = [
        ('101', 'フェブラリーＳ'),
        ('102', '高松宮記念'),
        ('103', '大阪杯'),
        ('104', '桜花賞'),
        ('105', '皐月賞'),
        ('106', '天皇賞（春）'),
        ('107', 'ＮＨＫマイルＣ'),
        ('108', 'ヴィクトリアマイル'),
        ('109', 'オークス'),
        ('110', '日本ダービー'),
        ('111', '安田記念'),
        ('112', '宝塚記念'),
        ('113', 'スプリンターズＳ'),
        ('114', '秋華賞'),
        ('115', '菊花賞'),
        ('116', '天皇賞（秋）'),
        ('117', 'エリザベス女王杯'),
        ('118', 'マイルチャンピオンシップ'),
        ('119', 'ジャパンカップ'),
        ('120', 'チャンピオンズＣ'),
        ('121', '阪神ジュベナイルＦ'),
        ('122', '朝日杯フューチュリティＳ'),
        ('123', '有馬記念'),
        ('124', 'ホープフルＳ')
    ]
    race_name = forms.ChoiceField(label='レース', choices=g1name)